Revit 2027 API
BuiltInFailures.MEPCalculationFailures.PipeConnectorsAreNotLined Property
 A calculation did not complete because the connectors used by this family to connect to the network are not linked.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId PipeConnectorsAreNotLined { get; }
Public Shared ReadOnly Property PipeConnectorsAreNotLined As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ PipeConnectorsAreNotLined {
	FailureDefinitionId^ get ();
}
static member PipeConnectorsAreNotLined : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MEPCalculationFailures Class
Autodesk.Revit.DB Namespace